#  iBGP.

###  Задание:

iBGP.

Цель: Настроить iBGP в офисе Москва
Настроить iBGP в сети провайдера Триада
Организовать полную IP связанность всех сетей

1. Настроите iBGP в провайдере Триада
2. iBGP в офисе Москва между маршрутизаторами R14 и R15
3. Настройте офиса Москва так, чтобы приоритетным провайдером стал Ламас.
4. Настройте офиса С.-Петербург так, чтобы трафик до любого офиса распределялся по двум линкам одновременно
5. Все сети в лабораторной работе должны иметь IP связность
6. План работы и изменения зафиксированы в документации


## 1. Настроите iBGP в провайдере Триада

### Схема сети

![](Schema_Triada.png)


- [Конфигурационные файлы](config/)


### Адресация Триада

 Триада (AS 520).

| Network IPv4     | Summary net    | Network IPv6             | Summary net         | Description   | Eq&port         |
|-----------------:|:---------------|-------------------------:|:--------------------|:-------------:|-----------------|
| 10.10.10.0/30    | 10.10.10.0/24  | 20AA:BBCC:10:0::/64      | 20AA:BBCC:10::/48   | Триада AS 520 | R23e0/1 R25e0/0 |
| 10.10.10.4/30    | 10.10.10.0/24  | 20AA:BBCC:10:4::/64      | 20AA:BBCC:10::/48   | Триада AS 520 | R25e0/2 R26e0/2 |
| 10.10.10.8/30    | 10.10.10.0/24  | 20AA:BBCC:10:8::/64      | 20AA:BBCC:10::/48   | Триада AS 520 | R26e0/0 R24e0/1 |
| 10.10.10.12/30   | 10.10.10.0/24  | 20AA:BBCC:10:12::/64     | 20AA:BBCC:10::/48   | Триада AS 520 | R23e0/2 R24e0/2 |


| Name    | IPv4LoopBack    |  City        |
|-----------------:|:---------------|-------------------------:|
|	R23	             |	23.23.23.23/32	|Триада |
|	R24	             |	24.24.24.24/32	|Триада |
|	R25	             |	25.25.25.25/32	|Триада |
|	R26	             |	26.26.26.26/32	|Триада |




### Конфигурация маршрутизаторов для iBGP соседства аналогична настройкам eBGP и сводиться к следующим настройкам:

1. Включаем на всех роутерах процес BGP с номером AS согласно схемы. 
          
       RX(config)#router BGP X - где X номер автономной системы.
       Для iBGP номер AS один и тот же в пределах этой AS
       
 Роутеры учавствующие в обмене BGP Update:
 
    R23 - Триада
    R24 - Триада
    R25 - Триада 
    R26 - Триада 
   
 
2. Назначаем на каждом роутере Router ID для BGP. 

       RX(config)#router bgp X
       RX(config-router)#bgp router-id x.x.x.x - где x.x.x.x номер роутера согласно схемы. R23 - router-id 23.23.23.23
     
     
3. Устанавливаем сосдество по iBGP согласно задания.
Для установления соседства по iBGP нужно устанавливать соседство каждый с каждым (Full Mesh) Предподчтителнее использовать LoopBack интерфейсы

       
 Пример для роутреа R23
 
       R23 - Триада (23.23.23.23)  - R24 - Триада (24.24.24.24)
       R23 - Триада (23.23.23.23)  - R25 - Триада (25.25.25.25)
       R23 - Триада (23.23.23.23)  - R26 - Триада (26.26.26.26)
       
       
  Для установления BGP соседства необходимо на каждом роутере указать команду:
  
       RX(config)#router bgp X
       RX(config-router)#neighbor x.x.x.x remote-as Z - где x.x.x.x IP соседа с кем устанавливается BGP, а Z - номер автономной системы BGP соседа
       RX(config-router)#neighbor x.x.x.x update-source loopback0 - команда update-source указывает из под какого интрефейса устанавливать соседство. В данном случае интерфейс loopback0
       
### Пример R23 Триада - R24 Триада
  
       R23(config)#router bgp 520
       R23(config-router)#neighbor 24.24.24.24 remote-as 520
       R23(config-router)#neighbor 24.24.24.24 update-source Loopback0
       
### Пример R24 Триада - R23 Триада
  
       R24(config)#router bgp 520
       R24(config-router)#neighbor 23.23.23.23 remote-as 520
       R24(config-router)#neighbor 23.23.23.23 update-source Loopback0       
       
  После выполнения данных команд на каждом роутере создается BGP соседвство.
  
### Пример роутера R23 и R26 Триада AS 520 после установления соседства по iBGP

![](R23.png)

![](R26.png)




## 2. iBGP в офисе Москва между маршрутизаторами R14 и R15

iBGP между роутерами R14 и R15 аналогична настройкам iBGP Триада

1. Включаем на всех роутерах процес BGP с номером AS согласно схемы. 
          
       RX(config)#router BGP X - где X номер автономной системы.
       Для iBGP номер AS один и тот же в пределах этой AS

Роутеры учавствующие в обмене BGP Update:
 
    R14 - Москва
    R15 - Москва
    
2. Назначаем на каждом роутере Router ID для BGP. (ID был назначен в первом задании по BGP, но повторюсь)  

       RX(config)#router bgp X
       RX(config-router)#bgp router-id x.x.x.x - где x.x.x.x номер роутера согласно схемы. R14 - router-id 14.14.14.14

3. Устанавливаем сосдество по iBGP согласно задания.

       R14 - Москва (14.14.14.14)  - R15 - Москва (15.15.15.15)
       R15 - Москва (15.15.15.15)  - R14 - Москва (14.14.14.14) 
 
Пример роутера R14 и R15 Москва AS 1001 после установления соседства по iBGP

![](R14.png)

![](R15.png)


## 3. Настройте офис Москвы так, чтобы приоритетным провайдером стал Ламас.

### Схема сети Москва

![](Moscow.png)

Как видно из скриншота, на роутере R14 префиксы (192.168.40.0/24 и 192.168.50.0/24) получаемые по BGP уходят через Киторн (50.50.50.1)

![](R14_Kitorn.png)

Trace VPC1 так же показывает, что маршрут идет через Киторн (50.50.50.1)

![](VPC1.png)

Для решения данной задачи можно использовать несколько вариантов:

1. Использовать атрибут Weight, но Weight это Cisco атрибут, соответсвенно он может применяться только между роутерами Cisco. В нашем варианте это подходит, но так же он не передается между роутерами, то есть локальный и этот атрибут придется настраивать на каждом роутере. В нашем случае это 2 роутера.... а если их будет 15-20?!, то настраивать придется на всех.

2. Иcпользовать атрибут Local Preference. Данные атрибут входит в группу Well-known discretionary. То есть распознается всеми маршрутизаторами. Так же его плюс в том, что он передается в Update в собсвенной AS между всеми роутерами-соседями iBGP. Т.е. задал атрибут на одном роутере и данный атрибут распространился на всех.
Для его настройки необходимо на роутере R15 выполнить следующие команды:

     R15(config)# route-map LAMAS permit 10 - создаем route-map
     R15(config-route-map)# set local-preference 150 - устанавливаем local-preference в значение 150 для всех маршрутов, которые мы получим от соседа
     R15(config-router)#neighbor 60.60.60.1 route-map LAMAS in - применяем route-map к соседу
     
 Как видно из скриншота на роутере R14 изменился LocPrf для префиксов 192.168.40.0 и 192.168.50.0, но в таблице BGP по прежнему в приоритете остается маршрут через Киторн (50.50.50.1). 
 
 ![](R14_Kitorn_2.png)
 
 ![](route_r14.png)
 
 
Это связанно с тем, что Update пришедший от роутера R21 Ламас на роутер R15 Москва содержит Next-Hop 60.60.60.1 и далее R15 передает этот Update по iBGP на роутер R14 не меняя Next-Hop. 
 
Соответственно у роутреа R14 нет маршрута до сети 60.60.60.0.

Для решения этой проблемы необходимо на роутере R15 задать команду:

     R15(config-router)#neighbor 14.14.14.14 next-hop-self - указать роутеру R14 использовать следующий переход роутера R15
     
Теперь таблица BGP и таблица маршрутизации роутреа R14 выглядит следующим образом:

![](route_r14_1.png)
    
 Trace VPC1 теперь идет через Ламас (60.60.60.1)
 
![](VPC1_1.png)
